000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаИсходящиеСообщения/КафкаИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КафкаИсходящиеСообщения</name>
  <resources>
    <name>СсылкаДляВыгрузки</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>ОтборДляВыгрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеНаименованиеОбъектаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусВыгрузки</name>
    <type>
      <types>EnumRef.КафкаСтатус</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВремяСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/КафкаПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаПродюсеры</name>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/КафкаОбработкаСобытийСлужебный/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Параметры регистрации.
// 
// Параметры:
//  Продюсеры - Неопределено, СправочникСсылка.КафкаПродюсеры, Массив Из СправочникСсылка.КафкаПродюсеры - Ссылка на продюсер
//  ПакетныйРежимЗаписи - Булево - Если Истина, то инициализируется "ОчередьИсходящих". По завершении необходимо вызвать ЗавершитьРегистрацию(Параметры)
// 
// Возвращаемое значение:
//  Структура - Параметры регистрации:
// * Продюсеры - Неопределено, Массив Из СправочникСсылка.КафкаПродюсеры - Ссылка на продюсер 
// * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящих, см. ЗавершитьРегистрацию
Функция ПараметрыРегистрации(Продюсеры = Неопределено, ПакетныйРежимЗаписи = Ложь) Экспорт
	
	Результат = Новый Структура;
	
	Если ТипЗнч(Продюсеры) = Тип("Массив") Тогда
		Результат.Вставить("Продюсеры", Продюсеры);
		
	ИначеЕсли ЗначениеЗаполнено(Продюсеры) Тогда
		Результат.Вставить("Продюсеры", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Продюсеры));
		
	Иначе
		 Результат.Вставить("Продюсеры", Неопределено);
	КонецЕсли;
	
	Результат.Вставить("ОчередьИсходящих", ?(ПакетныйРежимЗаписи,
		КафкаОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.КафкаИсходящиеСообщения), Неопределено));
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Завершает пакетную регистрацию.
// 
// Параметры:
//  Параметры - Структура - Параметры регистрации, см. ПараметрыРегистрации:
//	 * Продюсеры - Неопределено, Массив Из СправочникСсылка.КафкаПродюсеры - Ссылка на продюсер 
//	 * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящих, см. ЗавершитьРегистрацию
//	ОчиститьОчередь - Булево - Очистить очередь исходящих
Процедура ЗавершитьРегистрацию(Параметры, ОчиститьОчередь = Ложь) Экспорт
	
	ОчередьИсходящих = Параметры.ОчередьИсходящих;
	Если Не ОчередьИсходящих = Неопределено И ОчередьИсходящих.Количество() > 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОчередьИсходящих.Записать(Истина);
		Если ОчиститьОчередь = Истина Тогда
			ОчередьИсходящих.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает максимально допустимый размер порции регистрации.
//
// Возвращаемое значение:
//   Число - максимальный размер порции регистрации
Функция МаксРазмерПорцииРегистрации() Экспорт
	Возврат 10000;
КонецФункции

// Ключ конструктора сообщения.
// 
// Возвращаемое значение:
//  Строка - Ключ конструктора сообщения
Функция КлючКонструктораСообщения() Экспорт
	Возврат "кфк_a4bdb06b7b7df17d4f0fe377787ece84";
КонецФункции

// Помещает данные в очередь исходящих сообщений.
// 
// Параметры:
//  Источник - ЛюбаяСсылка - Ссылка на объект, подлежащий выгрузке;
//  		 - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, ПланСчетовОбъект, БизнесПроцессОбъект, ЗадачаОбъект, ПланОбменаОбъект - Объект, подлежащий выгрузке;
//			 - РегистрСведенийНаборЗаписей - Набор записей регистра сведений, подлежащий выгрузке;
//			 - Структура, Соответствие Из Произвольный - произвольное сообщение
//			 - Структура - Описание сообщения, см. КафкаИнтеграция.ПараметрыСообщения() 
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъект - Строка - Тип объект, подлежащий выгрузке.
//	ЭтоУдаление - Булево - Это удаление
//	ПараметрыРегистрации - Структура - Параметры регистрации, см. ПараметрыРегистрации:
//	 * Продюсеры - Неопределено, Массив Из СправочникСсылка.КафкаПродюсеры - Ссылка на продюсер 
//	 * ОчередьИсходящих - Неопределено, РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящих
//	Очередь - Неопределено, РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящие сообщений. 
//@skip-check method-too-many-params
Процедура ПоместитьВОчередьИсходящих(Источник, СобытиеРегистрации, ТипОбъект = "", ЭтоУдаление = Ложь, ПараметрыРегистрации = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Источник) = Тип("Структура") Или ТипЗнч(Источник) = Тип("Соответствие") Тогда // произвольное сообщение
		Если ПустаяСтрока(ТипОбъект) Тогда
			ВызватьИсключение НСтр("ru = 'В произвольном режиме необходимо явно указать тип объекта!'");
		КонецЕсли;
		
		Продюсеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "Продюсеры");
		Если Продюсеры = Неопределено Тогда
			//@skip-check dynamic-access-method-not-found
			Продюсеры = ПродюсерыОбъектаИнтеграции(ТипОбъект); // ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры
		КонецЕсли;
		Если Продюсеры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "ОчередьИсходящих");
		ОчередьИсходящих = ?(Очередь = Неопределено,
			КафкаОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.КафкаИсходящиеСообщения), Очередь); // РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения
		
		//@skip-check invocation-parameter-type-intersect
		ПоместитьВОчередьИсходящихПроизвольноеСообщение(Источник, СобытиеРегистрации, ТипОбъект, Продюсеры, ОчередьИсходящих);
		
		Если Очередь = Неопределено И ОчередьИсходящих.Количество() > 0 Тогда
			ОчередьИсходящих.Записать(Истина);
		КонецЕсли;
		
	Иначе
		ТипЗнчXML = СериализаторXDTO.XMLТипЗнч(Источник);
		Если ТипЗнчXML = Неопределено
				Или ТипЗнчXML.URIПространстваИмен <> "http://v8.1c.ru/8.1/data/enterprise/current-config" Тогда // проверка на тип конфигурации
			Возврат;
		КонецЕсли;
		ТипОбъектXML = ТипЗнчXML.ИмяТипа;
		
		ОбъектМД = Источник.Метаданные();
		Если ПустаяСтрока(ТипОбъект) Тогда
			ТипОбъект = ОбъектМД.ПолноеИмя();
		КонецЕсли;
		
		Продюсеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "Продюсеры");
		Если Продюсеры = Неопределено Тогда
			Продюсеры = ПродюсерыОбъектаИнтеграции(ТипОбъект); // ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры
		КонецЕсли;
		Если Продюсеры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Очередь = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРегистрации, "ОчередьИсходящих");
		ОчередьИсходящих = ?(Очередь = Неопределено,
			КафкаОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.КафкаИсходящиеСообщения), Очередь); // РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения
		
		ИмяБазовогоТипа = СтрРазделить(ТипОбъектXML, ".")[0];
		Если СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Object") Или СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Ref") Тогда // ссылочный тип
			ПоместитьВОчередьИсходящихСсылочногоТипа(Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML,
				Продюсеры, ТипОбъект, ОчередьИсходящих);
			
		ИначеЕсли ИмяБазовогоТипа = "InformationRegisterRecordSet"
				И ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда // регистр сведений
			ПоместитьВОчередьИсходящихНезависимыйРегистр(Источник, ЭтоУдаление, ОбъектМД, СобытиеРегистрации,
				ТипОбъектXML, Продюсеры, ТипОбъект, ОчередьИсходящих);
			
		ИначеЕсли ИмяБазовогоТипа = "InformationRegisterRecordSet"
					И ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору 
				Или ИмяБазовогоТипа = "AccumulationRegisterRecordSet" // регистр накопления
				Или ИмяБазовогоТипа = "AccountingRegisterRecordSet" // регистр бухгалтерии
				Или ИмяБазовогоТипа = "CalculationRegisterRecordSet" Тогда // регистр расчета
			ПоместитьВОчередьИсходящихПодчиненныйРегистр(Источник, ЭтоУдаление, ОбъектМД, СобытиеРегистрации,
				ТипОбъектXML, Продюсеры, ТипОбъект, ОчередьИсходящих);
			
		КонецЕсли;
		
		Если Очередь = Неопределено И ОчередьИсходящих.Количество() > 0 Тогда
			ОчередьИсходящих.Записать(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает уникальный ключ объекта, который используется в исходящих сообщениях для идентификации объекта.
// 
// Параметры:
//	Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи, РегистрНакопленияКлючЗаписи - Данные для регистрации.
//	HexСтрока - Булево - 
// 
// Возвращаемое значение:
//	Неопределено, Строка, ДвоичныеДанные - Ключ объекта
//
Функция КлючОбъекта(Данные, HexСтрока) Экспорт
	
	ТипЗнчXML = СериализаторXDTO.XMLТипЗнч(Данные);
	Если ТипЗнчXML = Неопределено
			Или ТипЗнчXML.URIПространстваИмен <> "http://v8.1c.ru/8.1/data/enterprise/current-config" Тогда // проверка на тип конфигурации
		Возврат Неопределено;
	КонецЕсли;
	ТипОбъектXML = ТипЗнчXML.ИмяТипа;
	ИмяБазовогоТипа = СтрРазделить(ТипОбъектXML, ".")[0];
	
	// Получение ключа объекта
	Если СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Object") Тогда
		Возврат XMLСтрока(Данные.Ссылка);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ИмяБазовогоТипа, "Ref") Тогда
		Возврат XMLСтрока(Данные);
		
	ИначеЕсли ИмяБазовогоТипа = "InformationRegisterRecordKey"
			И Данные.Метаданные().РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
		ПоляОтбора = СтрСоединить(КафкаОбщегоНазначенияСлужебный.КлючиРегистра(Данные.Метаданные()), ",");
		Отбор = Новый Структура(ПоляОтбора);
		ЗаполнитьЗначенияСвойств(Отбор, Данные);
		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Отбор);
		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешОбъекта.Добавить(СтрокаXML);
		Возврат ?(HexСтрока, ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма), ХешОбъекта.ХешСумма);
		
	ИначеЕсли ИмяБазовогоТипа = "InformationRegisterRecordKey"
			И Данные.Метаданные().РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору 
		Или ИмяБазовогоТипа = "AccumulationRegisterRecordKey" // регистр накопления
		Или ИмяБазовогоТипа = "AccountingRegisterRecordKey" // регистр бухгалтерии
		Или ИмяБазовогоТипа = "CalculationRegisterRecordKey" Тогда // регистр расчета
		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Данные.Регистратор);
		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешОбъекта.Добавить(СтрокаXML);
		Возврат ?(HexСтрока, ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма), ХешОбъекта.ХешСумма);
		
	Иначе // неизвестный тип
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает ключи записей исходящих сообщений для данных.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийКлючЗаписи, РегистрНакопленияКлючЗаписи - Данные для регистрации.
// 
// Возвращаемое значение:
//  Неопределено, Массив Из Строка - Ключи записей исходящих сообщений
Функция КлючЗаписиИсходящихСообщений(Данные) Экспорт
	
	КлючОбъекта = КлючОбъекта(Данные, Ложь);
	Если КлючОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Данные)).ПолноеИмя();
	
	Результат = Новый Массив; // Массив Из Строка
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.КафкаПродюсеры.ОбъектыМетаданных ГДЕ ТипОбъект = &ТипОбъект");
	Запрос.УстановитьПараметр("ТипОбъект", ТипОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеш.Добавить(XMLСтрока(Выборка[0]));
		Хеш.Добавить(НРег(ТипОбъект));
		Хеш.Добавить(КлючОбъекта);
		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
		
		Результат.Добавить(КлючЗаписи);
		
	КонецЦикла;
	
	Возврат ?(Результат.Количество() = 0, Неопределено, Результат);
	
КонецФункции

#Область ОбработчикиПодписок

// Обработчик подписки события "ЗарегистрироватьИзмененияПриЗаписи"
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзмененияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикРегистрацииПриЗаписи(Источник, Ложь);
	
КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияПередУдалением"
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Источник
//  Отказ - Булево - Отказ
Процедура ЗарегистрироватьИзмененияПередУдалением(Источник, Отказ) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикРегистрацииПриЗаписи(Источник, Истина);
	
КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияНабораПриЗаписи"
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзмененияНабораПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоУдаление = (Источник.Количество() = 0); // Булево
	ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление);
	
КонецПроцедуры

// Обработчик подписки события "ЗарегистрироватьИзмененияНабораРасчетаПриЗаписиПередЗаписью"
// 
// Параметры:
//	Источник - РегистрРасчетаНаборЗаписей - Источник
//	Отказ - Булево - Отказ
//	Замещение - Булево - Замещение
//	ТолькоЗапись - Булево - Только запись
//	ЗаписьФактическогоПериодаДействия - Булево - Запись фактического периода действия
//	ЗаписьПерерасчетов - Булево - Запись перерасчетов
Процедура ЗарегистрироватьИзмененияНабораРасчетаПриЗаписиПередЗаписью(Источник, Отказ, Замещение, ТолькоЗапись,
		ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов) Экспорт
	
	Если ПропуститьРегистрацию(Источник, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоУдаление = Источник.Количество() = 0; // Булево
	ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Продюсеры по ключу.
// 
// Параметры:
//	Ключ - Строка - Ключ
// 
// Возвращаемое значение:
//	Неопределено, ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры - Продюсеры
Функция ПродюсерыОбъектаИнтеграции(Ключ)
	Возврат КафкаИнтеграцияСлужебныйПовтИсп.ОбъектыИнтеграции().Получить(Ключ);
КонецФункции

// Пропустить регистрацию.
// 
// Параметры:
//	Источник - СправочникОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей, РегистрРасчетаНаборЗаписей - Источник
//	Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//	Булево - Пропустить регистрацию
Функция ПропуститьРегистрацию(Источник, Отказ)
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства; // Структура
	
	Возврат Отказ
		Или ДополнительныеСвойства.Свойство("кфкПропуститьРегистрацию")
		Или ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		Или ДополнительныеСвойства.Свойство("НеВыполнятьКонтрольУдаляемых")
		Или ДополнительныеСвойства.Свойство("СкрытиеКонфиденциальнойИнформации")
		Или ПродюсерыОбъектаИнтеграции(Источник.Метаданные().ПолноеИмя()) = Неопределено
		Или Не ПолучитьФункциональнуюОпцию("кфкИспользоватьИнтеграцию");
	
КонецФункции

// Обработчик событий "ЗарегистрироватьИзменения*"
// 	см. ЗарегистрироватьИзмененияПриЗаписи
// 	см. ЗарегистрироватьИзмененияНабораПриЗаписи
// 	см. ЗарегистрироватьИзмененияПередУдалением
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей, РегистрРасчетаНаборЗаписей - Любой объект или набор записей
//  ЭтоУдаление - Булево - Это удаление
Процедура ОбработчикРегистрацииПриЗаписи(Источник, ЭтоУдаление)
	
	Попытка
		
		ПоместитьВОчередьИсходящих(Источник, Перечисления.кфкСобытияРегистрации.ПриЗаписи, "", ЭтоУдаление);
		
	Исключение
		
		Данные = Неопределено;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОбъектМетаданных = Источник.Метаданные();
		Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
			Данные = Источник.Ссылка;
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
			ТекстОшибки = Строка(Источник.Отбор) + Символы.ПС + Символы.ПС + ТекстОшибки;
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(КафкаОбщегоНазначенияСлужебный.ИмяПодсистемы() + НСтр("ru = '. Регистрация при записи'"),
			УровеньЖурналаРегистрации.Ошибка,
			ОбъектМетаданных,
			Данные,
			ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Помещает в очередь исходящих ссылочный тип
// 
// Параметры:
//	Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихСсылочногоТипа(Источник, ЭтоУдаление, СобытиеРегистрации, ТипОбъектXML,
		Продюсеры, ТипОбъект, Очередь)
	
//	ТекущаяДата = ТекущаяДатаСеанса();
//	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	ЭтоОбъект = СтрНайти(ТипОбъектXML, "Object.") > 0;
//	
//	ИсходныеДанные = Новый Структура;
//	ИсходныеДанные.Вставить("Данные", Источник);
//	ИсходныеДанные.Вставить("ДополнительныеСвойства", ?(ЭтоОбъект, ПолучитьДополнительныеСвойства(Источник), Неопределено));
//	Тело = КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(ИсходныеДанные); // ХранилищеЗначения
//	
//	КлючОбъекта = XMLСтрока(?(ЭтоОбъект, Источник.Ссылка, Источник));
//	НТипОбъект = НРег(ТипОбъект);
//	
//	Для Каждого Продюсер Из Продюсеры Цикл // ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры
//		
//		Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
//		Хеш.Добавить(XMLСтрока(Продюсер));
//		Хеш.Добавить(НТипОбъект);
//		Хеш.Добавить(КлючОбъекта);
//		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
//		
//		НоваяСтрока = Очередь.Добавить();
//		// измерения
//		НоваяСтрока.КлючЗаписи = КлючЗаписи;
//		НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
//		// ресурсы
//		НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
//		НоваяСтрока.ИсходныеДанные = Тело;
//		НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
//		// дополнительная информация об объекте
//		НоваяСтрока.Продюсер = Продюсер;
//		НоваяСтрока.ТипОбъект = ТипОбъект;
//		НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
//		НоваяСтрока.КлючОбъекта = КлючОбъекта;
//		// дополнительная информация о регистрации
//		НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
//		НоваяСтрока.ДатаРегистрации = ТекущаяДата;
//		НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
//		
//	КонецЦикла;
	
КонецПроцедуры

// Помещает в очередь исходящих независимого регистра сведений
// 
// Параметры:
//	НаборЗаписей - РегистрСведенийНаборЗаписей - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	ОбъектМД - ОбъектМетаданныхРегистрСведений - Объект метаданных
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихНезависимыйРегистр(НаборЗаписей, ЭтоУдаление, ОбъектМД, СобытиеРегистрации, ТипОбъектXML,
		Продюсеры, ТипОбъект, Очередь)
	
//	ТекущаяДата = ТекущаяДатаСеанса();
//	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	ПоляОтбора = СтрСоединить(КафкаОбщегоНазначенияСлужебный.КлючиРегистра(ОбъектМД), ",");
//	//@skip-check invocation-parameter-type-intersect
//	ПоляЗаписи = СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(НаборЗаписей.ВыгрузитьКолонки().Колонки, "Имя"), ",");
//	
//	Если НаборЗаписей.Количество() > 0 Тогда
//		Таблица = НаборЗаписей; // РегистрСведенийНаборЗаписейИмяРегистраСведений, ТаблицаЗначений
//		
//	Иначе
//		Таблица = НаборЗаписей.Выгрузить(); // РегистрСведенийНаборЗаписейИмяРегистраСведений, ТаблицаЗначений
//		НоваяСтрока = Таблица.Добавить();
//		Для Каждого Элемент Из НаборЗаписей.Отбор Цикл
//			НоваяСтрока[Элемент.Имя] = Элемент.Значение;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	ДополнительныеСвойства = ПолучитьДополнительныеСвойства(НаборЗаписей);
//	
//	Для Каждого Запись Из Таблица Цикл // РегистрСведенийЗапись
//		
//		// КлючОбъекта - Хеш отбора
//		Отбор = Новый Структура(ПоляОтбора);
//		ЗаполнитьЗначенияСвойств(Отбор, Запись);
//		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Отбор);
//		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
//		ХешОбъекта.Добавить(СтрокаXML);
//		КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
//		
//		// Тело сообщения
//		Данные = Новый Структура(ПоляЗаписи);
//		ЗаполнитьЗначенияСвойств(Данные, Запись);
//		Данные.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);
//		Тело = КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения
//		
//		Для Каждого Продюсер Из Продюсеры Цикл
//			
//			ХешЗаписи = Новый ХешированиеДанных(ХешФункция.SHA256);
//			ХешЗаписи.Добавить(XMLСтрока(Продюсер));
//			ХешЗаписи.Добавить(НРег(ТипОбъект));
//			ХешЗаписи.Добавить(ХешОбъекта.ХешСумма);
//			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(ХешЗаписи.ХешСумма);
//
//			НоваяСтрока = Очередь.Добавить();
//			// измерения
//			НоваяСтрока.КлючЗаписи = КлючЗаписи;
//			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
//			// ресурсы
//			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
//			НоваяСтрока.ИсходныеДанные = Тело;
//			НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
//			// дополнительная информация об объекте
//			НоваяСтрока.Продюсер = Продюсер;
//			НоваяСтрока.ТипОбъект = ТипОбъект;
//			НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
//			НоваяСтрока.КлючОбъекта = КлючОбъекта;
//			// дополнительная информация о регистрации
//			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
//			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
//			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
//			
//		КонецЦикла;
//		
//	КонецЦикла;
	
КонецПроцедуры

// Помещает в очередь исходящих подчиненного регистра
// 
// Параметры:
//	НаборЗаписей - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей - Объект регистрации
//	ЭтоУдаление - Булево - Это удаление
//	ОбъектМД - ОбъектМетаданныхРегистрСведений - Объект метаданных
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъектXML - Строка - Тип объекта XML
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры - Продюсеры
//	ТипОбъект - Строка - Тип объекта
//	Очередь - РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящие сообщений 
Процедура ПоместитьВОчередьИсходящихПодчиненныйРегистр(НаборЗаписей, ЭтоУдаление, ОбъектМД, СобытиеРегистрации, ТипОбъектXML,
		Продюсеры, ТипОбъект, Очередь)
	
//	ТекущаяДата = ТекущаяДатаСеанса();
//	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение; // ДокументСсылка
//	Если Не ЗначениеЗаполнено(Регистратор) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДополнительныеСвойства = ПолучитьДополнительныеСвойства(НаборЗаписей);
//	
//	// КлючОбъекта - Хеш регистратора
//	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Регистратор);
//	ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
//	ХешОбъекта.Добавить(СтрокаXML);
//	КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
//	
//	// Тело сообщения
//	Данные = Новый Структура;
//	Данные.Вставить("Регистратор", Регистратор);
//	Данные.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);
//	Тело = КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения
//	
//	Для Каждого Продюсер Из Продюсеры Цикл
//		
//		ХешЗаписи = Новый ХешированиеДанных(ХешФункция.SHA256);
//		ХешЗаписи.Добавить(XMLСтрока(Продюсер));
//		ХешЗаписи.Добавить(НРег(ТипОбъект));
//		ХешЗаписи.Добавить(ХешОбъекта.ХешСумма);
//		КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(ХешЗаписи.ХешСумма);
//
//		НоваяСтрока = Очередь.Добавить();
//		// измерения
//		НоваяСтрока.КлючЗаписи = КлючЗаписи;
//		НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
//		// ресурсы
//		НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
//		НоваяСтрока.ИсходныеДанные = Тело;
//		НоваяСтрока.ЭтоУдаление = ЭтоУдаление;
//		// дополнительная информация об объекте
//		НоваяСтрока.Продюсер = Продюсер;
//		НоваяСтрока.ТипОбъект = ТипОбъект;
//		НоваяСтрока.ТипИсходныхДанных = ТипОбъектXML;
//		НоваяСтрока.КлючОбъекта = КлючОбъекта;
//		// дополнительная информация о регистрации
//		НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
//		НоваяСтрока.ДатаРегистрации = ТекущаяДата;
//		НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
//		
//	КонецЦикла;
	
КонецПроцедуры

//	Помещает в очередь исходящих произвольные данные
// 
// Параметры:
//	Сообщение - Структура - Описание произвольного сообщения, см. КафкаИнтеграция.ПараметрыСообщения():
//		* Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
//		* Ключ - Строка - Уникальный идентификатор сообщения
//		* Заголовки - Соответствие Из Строка - Заголовки сообщения
//	СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации
//	ТипОбъект - Строка - Тип объект
//	Продюсеры - ФиксированныйМассив Из СправочникСсылка.КафкаПродюсеры - Продюсеры
//	Очередь - РегистрСведенийНаборЗаписей.КафкаИсходящиеСообщения - Очередь исходящие сообщений
Процедура ПоместитьВОчередьИсходящихПроизвольноеСообщение(Сообщение, СобытиеРегистрации, ТипОбъект, Продюсеры, Очередь)
	
//	ТекущаяДата = ТекущаяДатаСеанса();
//	ТекущаяДатаМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
//	
//	Если Сообщение.Свойство(КлючКонструктораСообщения()) Тогда
//		Заголовки = ?(Сообщение.Заголовки.Количество() > 0,
//			КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение.Заголовки), Неопределено);
//		ТекстОшибки = "";
//		Данные = КафкаИнтеграцияСлужебный.ТелоСообщения(Сообщение, ТекстОшибки); // Неопределено, Структура
//		Если Данные = Неопределено Тогда
//			ВызватьИсключение ТекстОшибки;
//		КонецЕсли;
//		Тело = КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(Данные); // ХранилищеЗначения
//		
//		Если ЗначениеЗаполнено(Сообщение.Ключ) Тогда
//			КлючОбъекта = XMLСтрока(Сообщение.Ключ);
//			
//		Иначе
//			СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
//			ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
//			ХешОбъекта.Добавить(СтрокаXML);
//			КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
//			
//		КонецЕсли;
//		
//		Для Каждого Продюсер Из Продюсеры Цикл
//			
//			Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
//			Хеш.Добавить(XMLСтрока(Продюсер));
//			Хеш.Добавить(НРег(ТипОбъект));
//			Хеш.Добавить(КлючОбъекта);
//			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
//			
//			НоваяСтрока = Очередь.Добавить();
//			// измерения
//			НоваяСтрока.КлючЗаписи = КлючЗаписи;
//			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
//			// ресурсы
//			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Обработано;
//			НоваяСтрока.Заголовки = Заголовки;
//			НоваяСтрока.ТелоСообщения = Тело;
//			// дополнительная информация об объекте
//			НоваяСтрока.Продюсер = Продюсер;
//			НоваяСтрока.ТипОбъект = ТипОбъект;
//			НоваяСтрока.КлючОбъекта = КлючОбъекта;
//			// дополнительная информация о регистрации
//			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
//			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
//			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
//			
//		КонецЦикла;
//		
//	Иначе
//		СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Сообщение);
//		ХешОбъекта = Новый ХешированиеДанных(ХешФункция.SHA256);
//		ХешОбъекта.Добавить(СтрокаXML);
//		КлючОбъекта = ПолучитьHexСтрокуИзДвоичныхДанных(ХешОбъекта.ХешСумма);
//		
//		Тело = КафкаОбщегоНазначенияСлужебный.ЗначениеВХранилище(Сообщение); // ХранилищеЗначения
//		ТипИсходныхДанных = Строка(ТипЗнч(Сообщение));
//		
//		Для Каждого Продюсер Из Продюсеры Цикл
//			
//			Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
//			Хеш.Добавить(XMLСтрока(Продюсер));
//			Хеш.Добавить(НРег(ТипОбъект));
//			Хеш.Добавить(КлючОбъекта);
//			КлючЗаписи = ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма);
//			
//			НоваяСтрока = Очередь.Добавить();
//			// измерения
//			НоваяСтрока.КлючЗаписи = КлючЗаписи;
//			НоваяСтрока.ДатаРегистрацииМС = ТекущаяДатаМС;
//			// ресурсы
//			НоваяСтрока.Статус = Перечисления.кфкСтатусыСообщений.Новое;
//			НоваяСтрока.ИсходныеДанные = Тело;
//			// дополнительная информация об объекте
//			НоваяСтрока.Продюсер = Продюсер;
//			НоваяСтрока.ТипОбъект = ТипОбъект;
//			НоваяСтрока.ТипИсходныхДанных = ТипИсходныхДанных;
//			НоваяСтрока.КлючОбъекта = КлючОбъекта;
//			// дополнительная информация о регистрации
//			НоваяСтрока.СобытиеРегистрации = СобытиеРегистрации;
//			НоваяСтрока.ДатаРегистрации = ТекущаяДата;
//			НоваяСтрока.МеткаИзмененияМС = ТекущаяДатаМС;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
	
КонецПроцедуры

// Получить дополнительные свойства.
// 
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, БизнесПроцессОбъект, ПланОбменаОбъект, ДокументОбъект, ПланВидовРасчетаОбъект, ЗадачаОбъект, ПланСчетовОбъект, РегистрСведенийНаборЗаписей - Источник
// 
// Возвращаемое значение:
//  Структура - Получить дополнительные свойства
Функция ПолучитьДополнительныеСвойства(Источник)
	
	Результат = Новый Структура;
	
	Для Каждого Свойство Из Источник.ДополнительныеСвойства Цикл
		
		Если Свойство.Значение = Неопределено Тогда
			Результат.Вставить(Свойство.Ключ, Неопределено);
			
		Иначе
			ТЗначение = ТипЗнч(Свойство.Значение);
			ТЗначениеXML = СериализаторXDTO.XMLТипЗнч(Свойство.Значение);
			Если ТЗначение = Тип("Структура") Или ТЗначение = Тип("ФиксированнаяСтруктура")
				 Или ТЗначение = Тип("Соответствие") Или ТЗначение = Тип("ФиксированноеСоответствие")
				 Или ТЗначение = Тип("Массив") Или ТЗначение = Тип("ФиксированныйМассив")
				 Или ТЗначение = Тип("ТаблицаЗначений") Или ТЗначение = Тип("ДеревоЗначений") Тогда
				
				Попытка
					
					ОбщегоНазначения.ЗначениеВСтрокуXML(Свойство.Значение);
					
					Результат.Вставить(Свойство.Ключ, Свойство.Значение);
					
				Исключение
					Продолжить;
				КонецПопытки;
				
			ИначеЕсли ТЗначениеXML <> Неопределено
					И Не (ПустаяСтрока(ТЗначениеXML.URIПространстваИмен) Или ПустаяСтрока(ТЗначениеXML.ИмяТипа)) Тогда
				Результат.Вставить(Свойство.Ключ, Свойство.Значение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
